ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm33c321x/PKA_0.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="PKA" HW_revision="0.0">
    <group id="PKA_GPRCM" name="PKA_GPRCM" instances="1" offset="0x800" instaddr="0x100" description="">
        <register id="PKA_PWREN" width="32" offset="0x0" description="Power enable">
            <bitfield id="ENABLE" description="Enable the power" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable Power"/>
                <bitenum id="ENABLE" value="0x1" description="Enable Power"/>
            </bitfield>
        </register>
        <register id="PKA_RSTCTL" width="32" offset="0x4" description="Reset Control">
            <bitfield id="RESETSTKYCLR" description="Clear the RESETSTKY bit in the STAT register" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear reset sticky bit"/>
            </bitfield>
            <bitfield id="RESETASSERT" description="Assert reset to the peripheral" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="ASSERT" value="0x1" description="Assert reset"/>
            </bitfield>
        </register>
        <register id="PKA_STAT" width="32" offset="0x14" description="Status Register">
            <bitfield id="RESETSTKY" description="This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register" begin="16" end="16" width="1" rwaccess="R">
                <bitenum id="NORES" value="0x0" description="The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register"/>
                <bitenum id="RESET" value="0x1" description="The peripheral was reset since the last bit clear"/>
            </bitfield>
        </register>
        </group>
    <register id="PKA_PKA_APTR" width="32" offset="0x14000" description="A operand address offset">
        <bitfield id="APTR" description="This register specifies the location of Vector A within the PKA Data RAM. Vectors
are identified through the location of their least-significant 32-bit word. Note
that bit [0] must be zero to ensure that the vector starts at an 8-byte boundary" begin="10" end="0" width="11" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="PKA_PKA_BPTR" width="32" offset="0x14004" description="B operand address offset">
        <bitfield id="BPTR" description="This register specifies the location of Vector B within the PKA Data RAM. Vectors
are identified through the location of their least-significant 32-bit word. Note
that bit [0] must be zero to ensure that the vector starts at an 8-byte boundary" begin="10" end="0" width="11" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="PKA_PKA_CPTR" width="32" offset="0x14008" description="C operand address offset">
        <bitfield id="CPTR" description="This register specifies the location of Vector C within the PKA Data RAM. Vectors
are identified through the location of their least-significant 32-bit word. Note
that bit [0] must be zero to ensure that the vector starts at an 8-byte boundary" begin="10" end="0" width="11" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="PKA_PKA_DPTR" width="32" offset="0x1400C" description="D operand address offset">
        <bitfield id="DPTR" description="This register specifies the location of Vector D within the PKA Data RAM. Vectors
are identified through the location of their least-significant 32-bit word. Note
that bit [0] must be zero to ensure that the vector starts at an 8-byte boundary" begin="10" end="0" width="11" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="PKA_PKA_ALENGTH" width="32" offset="0x14010" description="Length of A operand">
        <bitfield id="ALENGTH" description="This register specifies the length (in 32-bit words) of Vector A" begin="9" end="0" width="10" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="PKA_PKA_BLENGTH" width="32" offset="0x14014" description="Length of B operand">
        <bitfield id="PKA_BLENGTH" description="This register specifies the length (in 32-bit words) of Vector B" begin="9" end="0" width="10" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="PKA_PKA_SHIFT" width="32" offset="0x14018" description="Bits to shift">
        <bitfield id="BITS_TO_SHIFT" description="This register specifies the number of bits to shift the input vector in the range 0 to 31 during a Rshift or Lshift operation" begin="4" end="0" width="5" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="PKA_PKA_FUNCTION" width="32" offset="0x1401C" description="control bits to start basic PKCP as well as complex Sequencer operations">
        <bitfield id="MULTIPLY" description="Perform multiply operation" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="ADDSUB" description="Perform combined add, subtract operation" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="MSONEBIT" description="Loads the location of the Most Significant one bit within the result word
indicated in the PKA_MSW register into bits [4:0] of the PKA_DIVMSW register,
can only be used with basic PKCP operations, except for Divide, Modulo and
Compare" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="ADD" description="Perform add operation." begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SUBTRACT" description="Perform subtract operation" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="RSHIFT" description="Perform right shift operation" begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="LSHIFT" description="Perform left shift operation" begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DIVIDE" description="Perform divide operation" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="MODULO" description="Perform modulo operation" begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="COMPARE" description="Perform compare operation" begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="COPY" description="Perform copy operation" begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQOP" description="These bits select the complex Sequencer operation to perform. The encoding of
these operations is determined by the Sequencer firmware" begin="14" end="12" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="RUNFUNC" description="The Host sets this bit to instruct the PKA module to begin processing the basic
PKCP or complex Sequencer operation. This bit is reset low automatically when
the operation is complete" begin="15" end="15" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQOPEXT" description="These bits select the complex Sequencer operation to perform. The encoding of
these operations is determined by the Sequencer firmware" begin="18" end="16" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="STALLRESULT" description="When written with a 1b, updating of the PKA_COMPARE, PKA_MSW and
PKA_DIVMSW registers, as well as resetting the Run bit is stalled beyond the
point that a running operation is finished" begin="24" end="24" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="PKA_PKA_COMPARE" width="32" offset="0x14020" description="Result of compare">
        <bitfield id="AEQB" description="Vector A = Vector B" begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="ALTB" description="Vector A &lt; Vector B" begin="1" end="1" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="AGTB" description="Vector A &gt; Vector B" begin="2" end="2" width="1" rwaccess="R">
        </bitfield>
    </register>
