ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm33c321x/PKA_0.0.xml
    <register id="PKA_PKA_MSW" width="32" offset="0x14024" description="MS non-zero word address">
        <bitfield id="ADDRESS" description="Address of the most significant non zero 32 bit word of the result vector in PKA Data RAM" begin="10" end="0" width="11" rwaccess="R">
        </bitfield>
        <bitfield id="ZERO_RESULT_VECTOR" description="The result vector is all zeroes, ignore the address returned in bits 10 to 0" begin="15" end="15" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="PKA_PKA_DIVMSW" width="32" offset="0x14028" description="MS non-zero word address for remainder (MOD and DIV ops)">
        <bitfield id="MSW_ADDRESS" description="Address of the most significant nonzero 32 bit word of the Remainder result vector in PKA Data RAM" begin="10" end="0" width="11" rwaccess="R">
        </bitfield>
        <bitfield id="ZERO_RESULT_VECTOR" description="The remainder result vector is all zeroes, ignore the address returned in bits 10 to 0" begin="15" end="15" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="PKA_PKA_ISTA_CTRL" width="32" offset="0x14030" description="This register provides control and status bits related to the Illegal State and Timing Attack features of the
PKCP">
        <bitfield id="DUMMY_CORR" description="1b = enable dummy correction cycles in the basic PKCP DIV and MOD operations. These dummy cycles remove the variability of these operations at the cost of a running time that can be up to around 70 percent  longer" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="FORCE_ERROR" description="1b = force FSM errors,  eg jump to an illegal state, when starting basic PKCP operations, these should activate the fsm_error bit in this register" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PARAM_ERROR" description="This bit is set to 1b when an illegal operation code selecting more than 1 operation at a time is written to the PKA_FUNCTION register.  It is also set to 1b
when the highest 32-bit word of the B vector (divisor) input to a PKCP DIV or MOD operation equals zero
MOD operation equals zero" begin="30" end="30" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="FSM_ERROR" description="This bit is set to 1b when one of the PKCP control FSMs enters an illegal state" begin="31" end="31" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="PKA_PKCP_PRIO_CTRL" width="32" offset="0x140C4" description="PKCP or Sequencer RAM Access Priority Control">
        <bitfield id="PKCP_RAM_PRIO" description="0b = Sequencer has priority for accessing data RAM. 1b = PKCP has priority for accessing data RAM." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="RAM_ECC_B0" description="Bit number for bit to flip in Bytes selected in field ram_ecc_test_0" begin="10" end="8" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="RAM_TEST_DUAL" description="Set this bit to 1b to produce dual errors, prior to setting ram_ecc_test. When this bit is enabled the next write to ram_ecc_test will set internal registers ram_ecc_test_0 and ram_ecc_test_1, When set to 0b, only ram_ecc_test_0 will be set" begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="RAM_ECC_B1" description="Bit number for bit to flip in Bytes selected in field ram_ecc_test_1" begin="14" end="12" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="RAM_TEST_ONCE" description="Writing 1b inserts errors only once, on the next write to the PKA Data RAM, all the ram_ecc_test bits will be reset to zero to prevent further error insertions" begin="15" end="15" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="RAM_ECC_TEST" description="Depending on ram_test_dual, internal registers ram_ecc_test_0 and ram_ecc_test_1 will be set, or only ram_ecc_test_0" begin="31" end="16" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="PKA_PKA_SEQ_CTRL" width="32" offset="0x140C8" description="PKA Squencer control or status">
        <bitfield id="SW_TRIGGERS" description="These bits can be used by software to trigger Sequencer operations" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQUENCER_STATUS" description="These read only bits are used by the Sequencer to communicate status to the outside world. Bit 8 is also used as Sequencer interrupt, with the complement of this bit OR-ed into the Run bit in PKA_FUNCTION" begin="15" end="8" width="8" rwaccess="R">
        </bitfield>
        <bitfield id="HAMMING_ERROR" description="A 1b indicates a mismatch was detected between bits 28:24 of a Sequencer instruction word and the Hamming protection code calculated from bits 23:0 of that same instruction word. This Hamming code detects at least 2 bit errors in bits 23:0. The state of this bit is OR-ed into the protection_int output of the engine" begin="16" end="16" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PARITY_ERROR" description="A 1b indicates parity error was detected" begin="17" end="17" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="ZERO_BUSY" description="When 1b is returned this read only bit indicates that the zeroization logic is busy. During zeroization the PKA cannot be used" begin="18" end="18" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="RAM_ECC_ERROR" description="Overall uncorrectable RAM SECDED EDC error status bit,This bit reads 1b when one or more uncorrectable error(s) occurred on the PKA  #br#Data RAM" begin="19" end="19" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQ_ECC_ERROR" description="Sequencer uncorrectable RAM SECDED EDC error. This bit reads 1b when an uncorrectable error occurred while the Sequencer reads the PKA Data RAM" begin="20" end="20" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQUENCER_UNLOCKED" description="This bit is set to 1b when the main Sequencer receives a SW reset during a complex operation, thereby unlocking the Sequencer. The bit is sticky: It can be cleared again by writing a 1b to this location. Writing a 0b has no effect" begin="22" end="22" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="RAM_ECC_CORR" description="Overall correctable RAM SECDED EDC error detected status bit." begin="23" end="23" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROGRAM_PAGE" description="This field provides two page select  bits for accessing the Sequencer program RAM through the Host interface when that is larger than 2K words. Value 00b selects page 0, the lowest page, value 01b selects page 1, etcetera" begin="30" end="29" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="RESET_FOR_SEQUENCER" description="reset for sequencer" begin="31" end="31" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="PKA_PKA_FW_OPTIONS" width="32" offset="0x140D0" description="FW options register">
        <bitfield id="RSA_SUPPORT" description="xxxxx1  : ModExp is supported
xxxx1x  :  ModExpCRT is supported
xxx1xx  : ModInv is supported
xx1xxx  : Reserved for SCAP command
x1xxxx  :  ditto
1xxxxx  : ditto" begin="5" end="0" width="6" rwaccess="R">
        </bitfield>
        <bitfield id="NIST_CURVE_SUPPORT" description="xxxxxxx1  :  ECpMUL is supported
xxxxxx1x  :  ECpMULxyz is supported
xxxxx1xx  :  Reserved for SCAP command
xxxx1xxx  :  ECpADD is supported
xxx1xxxx  :  ECpADDxyz is supported
xx1xxxxx  :  Not used, reserved for future use
x1xxxxxx  :  ditto
1xxxxxxx  :  ditto" begin="13" end="6" width="8" rwaccess="R">
        </bitfield>
        <bitfield id="MONT_CURVE_SUPPORT" description="xxx1  :  ECmontMUL is supported
xx1x  :  Reserved for SCAP command
x1xx  :  Not used, reserved for future use
1xxx  :  ditto" begin="17" end="14" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="DIGITAL_SIGNATURE_SUPPORT" description="xxxxxxxxx1  :  DSASIGN is supported
xxxxxxxx1x  :  DSAVERIFY is supported
xxxxxxx1xx  :  ECDSApSIGN is supported
xxxxxx1xxx  :  ECDSApVERIFY is supported
xxxxx1xxxx  :  SM2DSApSIGN is supported
xxxx1xxxxx  :  SM2DSApVERIFY is supported
xxx1xxxxxx  :  Reserved for SCAP command
xx1xxxxxxx  :  ditto
x1xxxxxxxx  :  ditto
1xxxxxxxxx  :  ditto" begin="27" end="18" width="10" rwaccess="R">
        </bitfield>
        <bitfield id="MISCELLANEOUS" description="xxx1  :  Reserved for Binary curve support
xx1x  :  Reserved for SCAP functionality extension
x1xx  :  Fixed-Point ECp multiplication is supported
1xxx  :  Shamirs trick is configured for ECDSApVERIFY and
 SM2DSApVERIFY" begin="31" end="28" width="4" rwaccess="R">
        </bitfield>
    </register>
