ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm33c321x/PKA_0.0.xml
    <register id="PKA_PKA_OPTIONS" width="32" offset="0x140F4" description="HW configured options">
        <bitfield id="PKCP_CONFIGURATION" description="Value 1 indicates a PKCP with a 16x16 multiplier, value 2 indicates a PKCP with a
32x32 multiplier, other values reserved" begin="1" end="0" width="2" rwaccess="R">
        </bitfield>
        <bitfield id="LNME_CONFIGURATION" description="Value 0 indicates NO LNME, value 1 indicates a standard LNME (with a single PE
chain), value 2 indicates a dual LNME (with two parallel PE chains), other values
reserved" begin="4" end="2" width="3" rwaccess="R">
        </bitfield>
        <bitfield id="SEQUENCER_CONFIGURATION" description="Value 1 indicates a standard Sequencer, other values reserved." begin="6" end="5" width="2" rwaccess="R">
        </bitfield>
        <bitfield id="PROGRAM_RAM" description="Value 1b indicates Sequencer program storage in RAM, value 0b in ROM" begin="7" end="7" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PROTECTION_OPTION" description="Value 0 indicates that no additional protection features are present.
Value 1 indicates that Illegal State and Timing Attack (ISTA) protection features
are present.
Value 3 indicates that ISTA protection features are present together with the
PROT feature (detection of invalid Sequencer opcodes).
Other values are reserved" begin="10" end="8" width="3" rwaccess="R">
        </bitfield>
        <bitfield id="INT_MASKING" description="Value 0b (default) indicates that the main interrupt output (bit [1] of the
interrupts output bus) is the direct complement of the Run bit in the
PKA_CONTROL register, value 1b indicates that interrupt masking logic is
present for this output." begin="11" end="11" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="MMM3A" description="When an LNME is present, this bit is 1b to indicate the MMM3A operation is
implemented, otherwise this bit equals 0b" begin="12" end="12" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="ZEROIZATION" description="Value 1b indicates that hardware zeroization logic is present" begin="13" end="13" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="PKA_PKA_SW_REV" width="32" offset="0x140F8" description="FW revision numbers, capabilities">
        <bitfield id="FW_PATCH_LEVEL" description="4 bits binary encoding of the firmware patch level, initial release will carry value
zero.
Patches are used to remove bugs without changing the functionality or interface
of a module" begin="19" end="16" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="MINOR_FW_REVISION" description="4 bits binary encoding of the minor firmware revision number" begin="23" end="20" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="MAJOR_FW_REVISION" description="4 bits binary encoding of the major firmware revision number" begin="27" end="24" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="FIRMWARE_CAPABILITIES" description="4 bits binary encoding for the functionality implemented in the firmware" begin="31" end="28" width="4" rwaccess="R">
        </bitfield>
    </register>
    <register id="PKA_PKA_REVISION" width="32" offset="0x140FC" description="PKA HW revision, EIP code">
        <bitfield id="BASIC_EIP_NUMBER" description="8 bits binary encoding of the EIP number, EIP-28 gives 0x1C" begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
        <bitfield id="COMPLEMENT_OF_BASIC_EIP_NUMBER" description="Bit-by-bit logic complement of bits [7:0], EIP-28 gives 0xE3" begin="15" end="8" width="8" rwaccess="R">
        </bitfield>
        <bitfield id="HW_PATCH_LEVEL" description="4 bits binary encoding of the hardware patch level, initial release will carry value
zero.
Patches are used to remove bugs without changing the functionality or interface
of a module" begin="19" end="16" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="MINOR_HW_REVISION" description="4 bits binary encoding of the minor hardware revision number" begin="23" end="20" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="MAJOR_HW_REVISION" description="4 bits binary encoding of the major hardware revision number" begin="27" end="24" width="4" rwaccess="R">
        </bitfield>
    </register>
    <register id="PKA_PKA_RAM_DATA" width="32" offset="0x16000" instances="512" instaddr="0x4" description="PKA DATA RAM - 512 Locations - 2KB">
    </register>
    <register id="PKA_AIC_POL_CTRL" width="32" offset="0x18000" description="Input Polarity Control Register">
        <bitfield id="PKA_INT_0" description="1 = high level/rising edge" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PKA_INT_1" description="1 = high level/rising edge" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PKA_INT_2" description="1 = high level/rising edge" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="TRNG_IRQ" description="1 = high level/rising edge" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SL_ERR_INT" description="1 = high level/rising edge" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROTECTION_INT" description="1 = high level/rising edge" begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="PKA_AIC_TYPE_CTRL" width="32" offset="0x18004" description="Input Type Control Register">
        <bitfield id="PKA_INT_0" description="1 = Edge" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PKA_INT_1" description="1 = Edge" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PKA_INT_2" description="1 = Edge" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="TRNG_IRQ" description="1 = Edge" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SL_ERR_INT" description="1 = Edge" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PROTECTION_INT" description="1 = Edge" begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="PKA_AIC_ENABLE_CTRL" width="32" offset="0x18008" description="Interrupt Enable Control Register">
        <bitfield id="ENABLECONTROL" description="0 = Disabled
1 = Enabled" begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="ENABLECONTROLBIT56" description="0 = Disabled
1 = Enabled" begin="6" end="5" width="2" rwaccess="R/W">
        </bitfield>
    </register>
