ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm33c321x/PKA_0.0.xml
    <register id="PKA_AIC_RAW_STAT" width="32" offset="0x1800C" description="Raw Interrupt Pending Status Register">
        <bitfield id="RAWSTATUS" description="0 = Inactive
1 = Pending" begin="3" end="0" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="RAWSTATUSBIT56" description="0 = Inactive
1 = Pending" begin="6" end="5" width="2" rwaccess="R">
        </bitfield>
    </register>
    <register id="PKA_AIC_ENABLE_SET" width="32" offset="0x1800C" description="Interrupt Enable Register">
        <bitfield id="ENABLESET" description="0 = Inactive
1 = Pending" begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="ENABLESETBIT56" description="0 = Inactive
1 = Pending" begin="6" end="5" width="2" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="PKA_AIC_ENABLED_STAT" width="32" offset="0x18010" description="Masked Interrupt Pending Status Register">
        <bitfield id="ENABLESTATUS" description="0 = Inactive
1 = Pending" begin="3" end="0" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="ENABLESTATUSBIT56" description="0 = Inactive
1 = Pending" begin="6" end="5" width="2" rwaccess="R">
        </bitfield>
    </register>
    <register id="PKA_AIC_ACK" width="32" offset="0x18010" description="Interrupt Acknowledge Register">
        <bitfield id="ACKNOWLEDGE" description="0 = No effect.
1 = Acknowledge the interrupt signal, clears the status bit. The activated bit of
Acknowledge will be cleared internally" begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="ACKNOWLEDGEBIT56" description="0 = No effect.
1 = Acknowledge the interrupt signal, clears the status bit. The activated bit of
Acknowledge will be cleared internally" begin="6" end="5" width="2" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="PKA_AIC_ENABLE_CLR" width="32" offset="0x18014" description="Interrupt Disable Register">
        <bitfield id="ENABLECLEAR" description="Individual interrupt disable bits per interrupt input 0 = No effect. 1 = Resets the corresponding bit in the AIC_ENABLE_CTRL register to '0', i.e. disables that interrupt. The activated bit of EnableClear will be cleared internally" begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="ENABLECLEARBIT56" description="0 = No effect.
1 = Acknowledge the interrupt signal, clears the status bit. The activated bit of
Acknowledge will be cleared internally" begin="6" end="5" width="2" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="PKA_AIC_OPTIONS" width="32" offset="0x18018" description="AIC Configuration Register">
        <bitfield id="NUMBER_OF_INPUTS" description="The EIP-201 supports up to 32 interrupt sources but the EIP-150 only has a
maximum of 7 internal interrupt sources when all options are present: PKA (3),
TRNG (1), reserved for backward compatibility (1), bus interface error (1) and PKA
protection (1)." begin="5" end="0" width="6" rwaccess="R">
        </bitfield>
    </register>
    <register id="PKA_AIC_VERSION" width="32" offset="0x1801C" description="AIC HW revision, EIP code">
        <bitfield id="BASIC_EIP_NUMBER" description="These bits encode the Rambus EIP number for the AIC. As the AIC is called the EIP-201 in
Rambuss IP numbering so this field contains the value 201 (decimal) or 0xC9" begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
        <bitfield id="COMPLEMENT_OF_BASIC_EIP_NUMBER" description="These bits simply contain the complement of bits [7:0] (0x36), used by a driver to ascertain
that the AIC_VERSION register is indeed read" begin="15" end="8" width="8" rwaccess="R">
        </bitfield>
        <bitfield id="PATCH_LEVEL" description="These bits encode the hardware patch level for this module  they start at value 0 on the
first release" begin="19" end="16" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="MINOR_REVISION" description="These bits encode the minor version number for this module" begin="23" end="20" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="MAJOR_REVISION" description="These bits encode the major version number for this module" begin="27" end="24" width="4" rwaccess="R">
        </bitfield>
    </register>
    <register id="PKA_EIP150_OPTIONS" width="32" offset="0x1BFF8" description="PKP Configuration Register">
        <bitfield id="SLAVE_INTERFACE" description="This field decodes the type slave interface that used for the EIP-150.
0b0001 : AHB slave interface.
0b0011 : AXI slave interface.
0b1001 : Asynchronous AHB slave interface.
0b1101 : Asynchronous APB slave interface.
Other values are reserved for future use" begin="3" end="0" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="EIP28_PRESENT" description="When set to 1: indicates that an EIP-28 PKA is included in the EIP-150" begin="8" end="8" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="EIP76_PRESENT" description="When set to 1: indicates that an EIP-76 TRNG is included in the EIP-150" begin="9" end="9" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="AIC_PRESENT" description="When set to 1: indicates that an EIP-201 AIC is included in the EIP-150" begin="10" end="10" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="RAM_ZEROIZE" description="When set to 1: indicates that PKA/LMNE RAM ZEROIZE logic is present" begin="11" end="11" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="PKA_EIP150_REVISION" width="32" offset="0x1BFFC" description="PKP HW revision, EIP code">
        <bitfield id="EIP_NUMBER" description="These bits encode the Rambus EIP number for the EIP-150" begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
        <bitfield id="BIT_BY_BIT_COMPLEMENT_OF_EIP_NUMBER" description="These bits simply contain the complement of bits 7 down to 0 used by a driver to ascertain that the EIP150_REVISION register is indeed read" begin="15" end="8" width="8" rwaccess="R">
        </bitfield>
        <bitfield id="PATCH_LEVEL" description="encoding for hardware patch level, they start at value 0 on the
first release" begin="19" end="16" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="MINOR_REVISION" description="These bits encode the minor version number for this module" begin="23" end="20" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="MAJOR_REVISION" description="These bits encode the major version number for this module" begin="27" end="24" width="4" rwaccess="R">
        </bitfield>
    </register>

</module>